In [48]:
# math & tables module
import numpy as np
import pandas as pd

# plotting module
from matplotlib import pyplot as plt
import seaborn as sns

# module to show version used in project
import session_info

# statistics module
from scipy import stats as st
import statsmodels.stats.proportion as sp

# imputer method using KNN
from sklearn.impute import KNNImputer

In [45]:
# session module version
session_info.show()

In [33]:
# reading dataset
data = pd.read_csv("train.csv", sep=';')

In [34]:
data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

## Data Cleaning

### Handle Missing Values
from descriptive statistics shown that there are 4 column contain missing-values but not in form of null-values, however in form of value of 'unknown' & 'other' in 4 column named: *job, education, contact, poutcome*

#### Job Variable

In [35]:
# Handling missing values in job column using frequent values replacing method
data.job.value_counts().to_frame().T

job,blue-collar,management,technician,admin.,services,retired,self-employed,entrepreneur,unemployed,housemaid,student,unknown
count,9732,9458,7597,5171,4154,2264,1579,1487,1303,1240,938,288

In [36]:
# replacing the unknown values using the most values containing column (mode) which 'blue-collar'
data.job.replace(to_replace='unknown', value=data.job.mode()[0], inplace=True)
data.job.value_counts().to_frame().T

job,blue-collar,management,technician,admin.,services,retired,self-employed,entrepreneur,unemployed,housemaid,student
count,10020,9458,7597,5171,4154,2264,1579,1487,1303,1240,938

After replacing with the mode value, the unknown which is the missing value have gone from the column

#### Education Variable

In [37]:
# Handling missing values in education column using frequent values replacing method
data.education.value_counts().to_frame().T

education  secondary  tertiary  primary  unknown
count          23202     13301     6851     1857

In [38]:
data.education.replace(to_replace='unknown', value=data.education.mode()[0], inplace=True)
data.education.value_counts().to_frame().T

education  secondary  tertiary  primary
count          25059     13301     6851

After replacing with the mode value, the unknown which is the missing value have gone from the column

#### Contact Variable

In [39]:
# Handling missing values in contact column using frequent values replacing method
data.contact.value_counts().to_frame().T

contact  cellular  unknown  telephone
count       29285    13020       2906

In [40]:
data.contact.replace(to_replace='unknown', value=data.contact.mode()[0], inplace=True)
data.contact.value_counts().to_frame().T

contact  cellular  telephone
count       42305       2906

After replacing with the mode value, the unknown which is the missing value have gone from the column

#### Poutcome Variable

In [49]:
data.poutcome.value_counts().to_frame().T

poutcome  unknown  failure  other  success
count       36959     4901   1840     1511

### Handle Duplicated Data

### Handle Outliers

## Feature Engineering